insert into author (author_name, nickname, birthday)
values ('Елизавета Иванцев', 'Елка', '01-01-1997'),
		('Анна Шурочкина', 'Нюша', '21-11-1992'),
		('Анна Вьялицина', 'Анна В', '23-10-1989'),
		('Наталья Полевщикова', 'Наташа Поли', '11-09-1986'),
		('Алла Перфилова', 'Валерия', '25-11-1982'),
		('Алисия Бет Мур', 'Пинк', '18-08-1992'),
		('Тара Лей Патрик', 'Кармен Электра', '25-03-1979'),
		('Виталий Грачев', 'Витас', '09-09-1985')

		
insert into genre (genre_name)
values ('Рок'), ('Поп'), ('Реп'), ('Металл'), ('Инди')


insert into album (album_name, create_date)
values ('Простецкий', 2018), 
	   ('Посложнее', 2018),
	   ('Средненький', 2022),
	   ('Замечательный', 2021),
	   ('Незаментый', 2014),
	   ('Нужный', 2019), 
	   ('Еще один', 2020)
	   

insert into track (track_name, duration, album_id)
values ('Улетела', 3.50, 1), ('Прилетела', 4.59, 2), ('Любовь', 3.44, 3), 
	('Весна', 4.43, 4), ('Лето', 3.13, 5), ('Осень', 4.42, 1), 
	('По пятам', 6.12, 2), ('По следам', 3.43, 3), ('My track', 3.13, 4), 
	('Как дела?', 3.06, 5), ('Пишу код', 3.55, 1), ('Процедура', 3.02, 2), 
	('Функция', 3.23, 3), ('Триггер', 2.06, 4), ('Мой Финал', 1.1, 5),
	('Трек № 1', 3.67, 3), ('Трек № 2', 4.06, 4), ('Трек № 3', 7.1, 5)
	('Трек № 1', 3.67, 6), ('Трек № 2', 4.06, 6), ('Трек № 3', 7.1, 7)



insert into playlist (playlist_name, create_date)
values ('Сборник № 1', 2018), 
	   ('Сборник № 2', 2018),
	   ('Сборник № 3', 2022),
	   ('Сборник № 4', 2021),
	   ('Сборник № 5', 2014),
	   ('Сборник № 6', 2021),
	   ('Сборник № 7', 2021),
	   ('Сборник № 8', 2019)


insert into album_author
values (1, 8), (2, 7), (3, 6),
	(4, 5), (5, 4), (1, 3), 
	(2, 2), (3, 1), (4, 8),
	(5, 7)
	
insert into author_genre (genre_id, author_id)
values (1, 8), (2, 7), (3, 6),
	(4, 5), (5, 4), (1, 3), 
	(2, 2), (3, 1), (4, 8),
	(5, 7)


insert into track_playlist (track_id, list_id)
values (2, 8), (2, 7), (15, 6),
	(4, 5), (5, 4), (6, 3), 
	(7, 2), (8, 1), (9, 8),
	(10, 7), (12, 8), (13, 8), 
	(14, 8),(15, 8), (11, 8), 
	(10, 8)

